let number = 1;

while (number <= 10) {
  console.log(number);
  number++;
}

// for ციკლი  გამოიყენება როდესაც ციკლის რაოდენობა წინასწარ ცნობილია. 
// while ციკლი უფრო მოქნილია და გამოიყენება როდესაც არ ვიცით რამდენჯერ უნდა იმუშაოს ციკლმა, მაგალითად სანამ მომხმარებელი არ შეიყვანს სწორ მონაცემს.


let count = 0; 

do {
  count++;
  console.log(count); 
} while (count < 10); 


// do...while გამოიყენება მაშინ, როდესაც გვსურს კოდი მინიმუმ ერთხელ მაინც შესრულდეს.

//while — არ არის გარანტია, რომ ციკლი ოდესმე შესრულდება.
let number = 5;

while (number < 5) {
  console.log("ეს არ დაიბეჭდება");
}




//do...while — ყოველთვის შესრულდება ერთხელ მაინც.
let number = 5;

do {
  console.log("ეს მაინც დაიბეჭდება");
} while (number < 5);